doom-emacs.org
* Configuration
Initial background color (prevent white flash at start)
#+BEGIN_SRC emacs-lisp
(add-to-list 'default-frame-alist '(background-color . "#282828"))
#+END_SRC

Splash image (based on THEME_VARIANT variable)
#+BEGIN_SRC emacs-lisp
;;(setq fancy-splash-image (concat doom-private-dir "splash/" "doom-emacs-color.png"))
;;(setq fancy-splash-image (concat doom-private-dir "splash/" "kid-flying-robots_neg.png"))
(setq-default
 +doom-dashboard-banner-dir (expand-file-name "splash/" doom-private-dir)
 +doom-dashboard-banner-file "kid-flying-robots_neg.png"
 +doom-dashboard-banner-padding '( 0 . 0 ))
#+END_SRC

Theme (based on THEME_VARIANT variable)
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-gruvbox)
;;(setq doom-theme 'doom-tokyo-night)
;;(setq doom-theme 'doom-palenight)
#+END_SRC

Line numbers
#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type t)
#+END_SRC

Org directory
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org")
#+END_SRC

Identification
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Kevin Kaiser"
      user-mail-address "k8x1d@proton.me")
#+END_SRC

Fonts
#+BEGIN_SRC emacs-lisp
;;(setq doom-font (font-spec :family "DejaVu Sans Mono" :size 16)
;;      doom-variable-pitch-font (font-spec :family "DejaVu Sans" :size 16))


(setq doom-font (font-spec :family "JetBrains Mono" :size 16 :weight 'normal)
      doom-big-font (font-spec :family "JetBrains Mono" :size 20 :weight 'normal)
      doom-unicode-font (font-spec :family "JetBrains Mono" :size 14)
      doom-variable-pitch-font (font-spec :family "Iosevka Aile" :size 16))

#+END_SRC

Forge token
#+BEGIN_SRC emacs-lisp
(setq auth-sources '("~/.authinfo"))
#+END_SRC

Highlight whole selected line (everywhere)
#+BEGIN_SRC emacs-lisp
;;(add-hook 'after-init-hook 'global-hl-line-mode)
#+END_SRC

Mixed font
#+BEGIN_SRC emacs-lisp :tangle .doom.d/packages.el
;;(package! mixed-pitch)
#+END_SRC

#+BEGIN_SRC emacs-lisp
;;(use-package! mixed-pitch
;;  :hook
;;  ;; If you want it in all text modes:
;;  (text-mode . mixed-pitch-mode))
#+END_SRC

Latex support
#+BEGIN_SRC emacs-lisp
(setq reftex-default-bibliography "/home/k8x1d/Zotero/k8x1d.bib")
(setq +latex-viewers '(pdf-tools))
#+END_SRC

Pdf dark mode
#+BEGIN_SRC emacs-lisp
(use-package! pdf-tools
  :hook (pdf-view-mode . pdf-view-midnight-minor-mode))
#+END_SRC

Zotero support
#+BEGIN_SRC emacs-lisp
(setq! citar-bibliography '("/home/k8x1d/Zotero/k8x1d.bib"))
(setq! citar-library-paths '("/home/k8x1d/Zotero/storage/")
       citar-notes-paths '("/home/k8x1d/Zotero/notes/"))
#+END_SRC

Transparency (use doom native function)
#+BEGIN_SRC emacs-lisp
;;;;; For emacs < 29
;;(set-frame-parameter (selected-frame) 'alpha '(90 . 90))
;;(add-to-list 'default-frame-alist '(alpha . (90 . 90)))
;;(setq doom/set-frame-opacity 95)
;;;(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
;;;(add-to-list 'default-frame-alist '(fullscreen . maximized))

;;;; ;; Set transparency of emacs
;;(defun kk/transparency (value)
;;  "Sets the transparency of the frame window. 0=transparent/100=opaque"
;;  (interactive "nTransparency Value 0 - 100 opaque:")
;;  (set-frame-parameter (selected-frame) 'alpha value))

;;;; For emacs >= 29
;;(set-frame-parameter nil 'alpha-background 80)
;;(add-to-list 'default-frame-alist '(alpha-background . 80))
;;
;;;; function to change transparency
;;(defun kk/transparency (value)
;;  "Sets the transparency of the frame window. 0=transparent/100=opaque"
;;  (interactive "nTransparency Value 0 - 100 opaque:")
;;  (set-frame-parameter (selected-frame) 'alpha-background value))

;;(if (eq window-system 'pgtk)
;;    (set-frame-parameter nil 'alpha-background 80))
;;
;;(if (eq window-system 'pgtk)
;;    (add-to-list 'default-frame-alist '(alpha-background . 80)))

#+END_SRC

Pomodoro customization
#+BEGIN_SRC emacs-lisp
(setq alert-user-configuration (quote ((((:category . "org-pomodoro")) libnotify nil))))
(setq org-pomodoro-length 50)
(setq org-pomodoro-short-break-length 10)
(setq org-pomodoro-long-break-length 30)
#+END_SRC

Remove auto-reformat table when change evil state
#+BEGIN_SRC emacs-lisp
(remove-hook 'org-mode-hook #'+org-enable-auto-reformat-tables-h)
#+END_SRC

Mixed font in text mode
#+BEGIN_SRC emacs-lisp
(add-hook! 'text-mode-hook #'mixed-pitch-mode)
(add-hook! 'text-mode-hook #'solaire-mode)
(setq mixed-pitch-variable-pitch-cursor nil)
#+END_SRC

Default browser
#+BEGIN_SRC emacs-lisp
(setq browse-url-browser-function 'browse-url-generic
      browse-url-generic-program "firefox")
#+END_SRC

* Julia support
julia-vterm version
#+BEGIN_SRC emacs-lisp :tangle .doom.d/packages.el
(package! julia-repl :disable t)
(package! julia-vterm)
(package! ob-julia-vterm)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(use-package! julia-vterm
  :hook
  (julia-mode . julia-vterm-mode)
  :config
  ;;(setq julia-vterm-repl-program "/usr/bin/julia -t 12")
  (map! :localleader
        :map julia-mode-map
        "'" #'julia-vterm-switch-to-repl-buffer
        "RET" #'julia-vterm-send-region-or-current-line
        "b" #'julia-vterm-send-buffer
        "f" #'julia-vterm-send-include-buffer-file
        "d" #'julia-vterm-send-cd-to-buffer-directory))

(use-package! ob-julia-vterm
  :config
  (add-to-list 'org-babel-load-languages '(julia-vterm . t))
  (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
  (defalias 'org-babel-execute:julia 'org-babel-execute:julia-vterm)
  (defalias 'org-babel-variable-assignments:julia 'org-babel-variable-assignments:julia-vterm)
  )
#+END_SRC

julia-repl version
#+BEGIN_SRC emacs-lisp
;;(after! julia-repl
;;  (julia-repl-set-terminal-backend 'vterm)
;;  (setq vterm-kill-buffer-on-exit nil))
#+END_SRC

LSP
#+BEGIN_SRC emacs-lisp
;;(after! lsp-julia
;;  (setq lsp-julia-default-environment "~/.julia/environments/v1.8"))
;;;;(setq eglot-jl-language-server-project "~/.julia/environments/v1.8")
#+END_SRC

* LanguageTool support
#+begin_src emacs-lisp :tangle .doom.d/packages.el
(package! lsp-ltex)
;;(package! eglot-ltex
;; :recipe (:host github
;;           :repo "emacs-languagetool/eglot-ltex"))
#+end_src

#+begin_src emacs-lisp
(use-package! lsp-ltex
  :hook (LaTeX-mode . (lambda ()
                        (require 'lsp-ltex)
                        (lsp-deferred)))
  :init
  (setq lsp-ltex-version "15.2.0")
  :config
  (defun kk/start-ltex ()
    (interactive)
    (require 'lsp-ltex)
    (call-interactively #'lsp))
  )
#+end_src


#+begin_src emacs-lisp
;;(use-package! eglot-ltex
;;  :hook (LaTeX-mode . (lambda ()
;;                        (require 'lsp-ltex)
;;                        (lsp-deferred)))
;;  :init
;;  (setq eglot-languagetool-server-path "~/Documents/Developpement/Logiciels/Editeurs/2022/A/ltex-ls-15.2.0/")
;;  :config
;;  (defun kk/start-ltex ()
;;    (interactive)
;;    (require 'eglot-ltex)
;;    (call-interactively #'eglot))
;;  )
#+end_src
